<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2003-2023 www.yisu.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 亿速网络（http://www.yisu.cn）
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace Common\Behavior;

use Common\Logic\StoreSellerLogic;
use Common\Tool\Tool;

/**
 * 搜索行为
 * @author 王强
 * @version 1.0.0
 */
class SearchBehavior
{
    /**
     * 参数
     * @var array
     */
    
    private $obj;
    
    
    /**
     * 架构方法
     * @param array $args
     */
    public function __construct($obj)
    {
        $this->obj  = $obj;
    }
    
    /**
     * 组装搜索条件
     * @return array
     */
    public function buildSearch()
    {
        $modelObj = $this->obj->getLogic()->getModelObj();
        
        $splitKey = $modelObj::$id_d;
        
        $sellerLogic = new StoreSellerLogic($this->obj->getArgs(), $splitKey);
        
        Tool::connect('parseString');
        
        $where = $sellerLogic->getSearchBuildWhere();
        
        return $where;
    }
    
}