<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2003-2023 www.yisu.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 亿速网络（http://www.yisu.cn）
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace Admin\Controller;

use Common\TraitClass\InitControllerTrait;
use Admin\Logic\GoodsClassLogic;
use Common\TraitClass\IsLoginTrait;
use Common\Tool\Tool;

/**
 * 添加自营店铺选择商品分类
 * @author Administrator
 *
 */
class GoodsClassSelectController
{
	/**
	 * 初始化插件
	 */
	use InitControllerTrait;
	
	/**
	 * 是否登录插件
	 */
	use IsLoginTrait;
	
	
	/**
	 * 构造方法
	 *
	 * @param array $args
	 */
	public function __construct(array $args = [])
	{
		// 初始化
		$this->init();
		
		$this->isNewLoginAdmin();
		
		// 属性赋值
		$this->args = $args;
		
		// 对象属性赋值【实例化逻辑处理对象】
		$this->logic = new GoodsClassLogic($args);
		
		
	}
	
	/**
	 * 商品分类显示列表【三秒钟缓存】
	 */
	public function index()
	{
		Tool::connect('parseString');
		
		$tree = $this->logic->buildClass();
		
		$this->objController->ajaxReturnData($tree);
	}
}