<?php
// +----------------------------------------------------------------------
// | OnlineRetailers [ WE CAN DO IT JUST THINK IT ]
// +----------------------------------------------------------------------
// | Copyright (c) 2003-2023 www.yisu.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed 亿速网络（http://www.yisu.cn）
// +----------------------------------------------------------------------
// | Author: 王强 <13052079525>
// +----------------------------------------------------------------------
// |简单与丰富！
// +----------------------------------------------------------------------
// |让外表简单一点，内涵就会更丰富一点。
// +----------------------------------------------------------------------
// |让需求简单一点，心灵就会更丰富一点。
// +----------------------------------------------------------------------
// |让言语简单一点，沟通就会更丰富一点。
// +----------------------------------------------------------------------
// |让私心简单一点，友情就会更丰富一点。
// +----------------------------------------------------------------------
// |让情绪简单一点，人生就会更丰富一点。
// +----------------------------------------------------------------------
// |让环境简单一点，空间就会更丰富一点。
// +----------------------------------------------------------------------
// |让爱情简单一点，幸福就会更丰富一点。
// +----------------------------------------------------------------------
namespace Common\TraitClass;

/**
 * 添加地区Trait
 * @author 王强
 */
trait AddAreaTrait {

    /**
     * 添加包邮地区
     */
    public function addArea()
    {
        $idString = null;
        
        $area = array();
       
        $model = $this->modelObj;
        
        $i = 0;
        foreach ($this->data[$model::$mailArea_d] as $key => $value) {
            $area[$i][$model::$mailArea_d] = $value;
            $area[$i][$model::$freightId_d] = $this->data['id'];
            $i ++;
        }
        $status = $model->where($model::$freightId_d . ' = %d', $this->data[$this->splitKey])->delete();
      
        if (! $model->traceStation($status)) {
            return false;
        }
        
        $status = $model->addAll($area);
        
        if (! $model->traceStation($status)) {
            $this->errorMessage = '保存地区错误';
            return false;
        }
        $commit = $model->commit();
        // showData($commit, 1);
        return $status;
    }
}